package co.jp.smart_business.common.message;

public enum Messages {
    
    // CM: 共通系
    CM1001("CM1001"),
    CM1002("CM1002"),
    CM1003("CM1003"),
    CM1004("CM1004"),
    CM1005("CM1005"),
    CM1006("CM1006"),
    CM1007("CM1007"),
    CM1008("CM1008"),
    CM1009("CM1009"),
    CM1010("CM1010"), //スケジュール rowsid　不正エラー
    CM1011("CM1011"), //画像upload 不正エラー
    CM1012("CM1012"), //画像file delete 不正エラー
    CM1013("CM1013"), //パスワード忘れ、パスワードリセット登録エラー
    CM1014("CM1014"), // アップローダファイルサイズ上限を超えるエラー
    // AU: 認証系
    AU1001("AU1001"),
    AU1002("AU1002"),
    AU1003("AU1003"),
    AU1004("AU1004"),
    AU1005("AU1005"),
    AU1006("AU1006"),
    AU1007("AU1007"),
    AU1008("AU1008"),   // パスワード忘れメール存在しない
    AU1009("AU1009"),   // パスワードリセット期限すぎ
    AU1010("AU1010"),   // パスワードリセット時、パスワードと確認パスワード一致しない
    AU1011("AU1011"),   // パスワード変更時、旧パスワード不正
    
    // timeline系
    TM1001("TM1001"),
    
    // トーク系
    TK1001("TK1001"),   // 該当トークが見つかりませんでした。
    TK1002("TK1002"),   // 該当ユーザが見つかりませんでした。
    TK1003("TK1003"),   // 該当トークメッセージが見つかりませんでした。
    
    // 予約系
    RE1001("RE1001"),   // 予約不可のキャストが見つかりました。大変お手数ですが、キャストを選択し直してください。
    RE1002("RE1002"),   // 残高が不足しています。チャージしてください。
    RE1003("RE1003"),   // 最大予約件数を超えました。
    RE1004("RE1004"),   // 該当予約は見つかりませんでした。
    RE1005("RE1005"),   // 処理中の予約のみキャセル可能。
    RE1006("RE1006"),   // 過去の予約のみ削除可能。
    RE2001("RE2001"),   // 正しい合流予定を選択してください。
    RE2002("RE2002"),   // 合流予定時間を指定してください。
    RE2003("RE2003"),   // 合流予定時間は少なくとも30分後にしてください。
    RE2004("RE2004");   // 予約時間を30分単位で指定してください。

    private final String code;
    
    public static final String SUCCESS = "1000";
    
    /**
     * @param code
     */
    private Messages(String code) {
        this.code = code;
    }

    /**
     * code
     * @return
     */
    public String value() {
        return code;
    }

}
